import 'package:flutter/material.dart';

import 'favorites_model.dart';
import 'recipe_model.dart';

class Recipes extends ChangeNotifier {
  Favorites? favorites;

  List<Recipe> items = [
    Recipe(
      id: 'boulfaf',
      imageAsset: 'assets/images/boulfaf.jpg',
      title: 'بولفاف',
      rating: 5,
      ingredients: [
        'كبدة الخروف',
        'قلب الخروف',
        'شحم الخروف',
        'كمون',
        'ابزار',
        'ملح',
      ],
      cookGuides: [
        'فوق فحم مشتعل، ضعي الكبدة تشوى من جميع الجوانب حتى لا تصبح رخوة, نفس الشيء بالنسبة للقلب, خذي الكبدة المشوية وقطعيها الى مربعات متوسطة الحجم وكذلك القلب.',
        'رشي الكمون والابزار والملح حسب الذوق وخلطي جيدا.',
        'خذي الشحم وقطعيه الى مربعات ثم لفي قطع الكبدة والقلب بمربعات الشحم وصففيهم في قضيب حديدي.',
        'عند الانتهاء من تصفيف بولفاف، ضعيه فوق الشواية واتركيه يشوى من جميع الجوانب حتى يتحمر.',
        'في طبق التقديم ضعي بولفاف ثم رشي عليه قليلا من الكمون والابزار.',
        'تقدم هذه الاكلة ساخنة بالف صحة وعافية.',
      ],
    ),
    Recipe(
      id: 'chwa',
      imageAsset: 'assets/images/del3a.jpg',
      title: 'الضلعة او الشواء',
      rating: 4.3,
      ingredients: [],
      cookGuides: [
        'نأخد الضلعة ونشرحوها بالسكين لكي يدخل البخار للداخل ونأخد بصلة مفرومة ونخلطو معاها شوي ابزار وملح وكامون انا احب اضيف زعفران حر شعرة يعطيها لذة وذوق طيب ونخلطهم بشوية بزبدة او زيت نباتي ونفرك بيهم الضلعة جيدا ونتركها ساعتين لغاية ما تتشرب من التوابل ونحطها في قدر البخار او طنجرة الضغط انا أفضل القدر لانها طريقة تقليدية و تستوي على مهلها ودا احسن طريقة لطهيها لاتنسين تضعي الماء الكافي في القدر ومعه قطعة الليمون لكي لا يسود القدر واغلفيه من فوق بورق الاليمنيوم وتركي اللحم على البخار لمدة ساعتين او عندما تريناه استوى يدهن بالزبدة ويحمر في الفرن نأخد طبق التقديم ونضع الضلعة المبخرة و التي قدمناها بطريقة جميلة مع خص في الجوانب و خضر متنوعة مصلوقة جبن زيتون كاشير و تزين حسب الدوق والطبق يكون مرفقا بكامون وملح لزيادته حسب الذوق وكذلك سلطة من اختيارنا وتقدم دائما مع براد الشاي المغربي المنعنع وبالصحة والرحة وهذه بعض الطرق البريستيج لتقديم الضلعة او الشواء على الطريقة المغربية .'
      ],
    ),
    Recipe(
      id: 't9liya-lmghribiya',
      imageAsset: 'assets/images/ta9liya.jpeg',
      title: 'التقلية المغربية',
      rating: 4.2,
      ingredients: [
        'دوارة الخروف (كرشة/رئة/…..)',
        'بصل',
        'ثوم',
        'ملح',
        'ابزار',
        'فلفل أحمر',
        'كمون',
        'خرقوم',
        'زيت زيتون',
        'قزبر و معدنوس',
      ],
      cookGuides: [
        'نغسل الكرشة جيدا (وذلكها بسلقها قليلا ثم نكرطها جيدا بسكين) و نقطعها ثم نقطع الرئة و كل عناصر التقلية..',
        'ثم نضيف البصل مقطع ثوم محكوك ملح و التوابل شوية زيت زيتون و قزبر و معدنوس مقطعين و نتركها تتقلى مع التحريك ثم نضيف الماء و نقفل',
        'بعد ماتطهى نتركها تتشرب جيدا',
      ],
    ),
    Recipe(
      id: 'lmreuziya',
      imageAsset: 'assets/images/lmreuziya.png',
      title: 'المروزية',
      rating: 4.6,
      ingredients: [
        'كيلو و نصف لحم من العنق أو الكتف',
        'زيت زيتون',
        'القلييل من الملح',
        'الابزار',
        'الخرقوم',
        'سكنجبير',
        'الزعفران الحر',
        'توابل المروزية (تباع عند العطار)',
        'بصلة متوسطه',
        'قطعة زبدة',
        'قطعة صغيرة سمن',
        'الزبيب',
        'ملعقتي عسل',
        'ملعقة قرفة',
        '150غ لوز',
      ],
      cookGuides: [
        'نمزج زيت زيتون و التوابل و ندهن اللحم جيدا بهذا الخليط و نتركه ليلة كاملة',
        'نسلق اللوزو نقشره و نقليه',
        'ننقع الزبيب في الماء',
        'نضع اللحم في الطنجرة و نضيف له بصلة مقطعه قطع صغيرة الزبدة السمن و نتركه يتقلى جيدا ثم نضيف الماء الكافي لطهيه و نقفل عليه',
        'بعد ما يطهى اللحم نضيف له الزبيب العسل و  القرفة',
        'و نتركه على النار حتى يطهى الزبيب و يتخثر المرق',
        'نقدمه مزين باللوز. ',
        'ألف صحة',
      ],
    ),
    Recipe(
      id: 'lktef-m3mmer-blkbda-o-m7ammer',
      imageAsset: 'assets/images/lktef-m3mer-blkbda.jpeg',
      title: 'كتف الخروف معمر بالكبد و محمر',
      rating: 4.8,
      ingredients: [
        'كتف لحم الخروف',
        'ثوم',
        'الزيت',
        'الملح',
        'الابزار',
        'سكنجبير',
        'كبد',
        'ثوم',
        'البصل الاخضر',
        'زيتون مقطع',
        'ملح',
        'ابزار',
        'فلفل احمر',
        'هريسة',
        'خرقوم',
        'شعرية صينية',
        'قزبر و معدنوس',
        'زيت زيتون',
        'أوراق المعدنوس',
        'خضر مبخرة',
        'زيتون',
        'جبن',
        'مورتديلا',
      ],
      cookGuides: [
        'نقطع الكبد و البصل الاخضر قطع صغيرة',
        'نضع الشعرية الصينية في المضء الساخن ثم نصفيها و نقطعها',
        'نمزج جميع العناصر مع بعض جيدا',
        'نفتح الكتف و نملأه بالحشو ثم نحكم اغلاقه بالخيط',
        'نغرس الثوم في اللحم و ندهنه بخليط الزيت الملح الابزار و سكنجبير',
        'نغطيه و ندخله الفرن حتى يطهى مع دهنه في كل مرة بشوية زبدة كي لا يجف «لكنه ياخذ وقت في فرن المنزل» اذا كان الكتف ذو حجم صغير يمكن طهيه على البخار ثم ندخله الفرن ليتحمر',
        'انا ارسلته لفرن الحي',
      ],
    ),
    Recipe(
      id: 'l7em-m3a-khdra-mbkhra',
      imageAsset: 'assets/images/l7em-mchwi.png',
      title: 'لحم مشوي مع خضر مبخرة',
      rating: 4.4,
      ingredients: [
        'لحم الخروف',
        'ثوم',
        'الزيت',
        'الملح',
        'الابزار',
        'سكنجبير',
        'خس',
        'خضر مبخرة',
        'زيتون',
        'سوريمي',
        'مورتديلا',
      ],
      cookGuides: [
        'ننقي الثوم',
        'نأخذ اللحم و نغرس فيه الثوم في أماكن متفرقة',
        'نمزج الزيت مع الملح و الابزار و سكنجبير ثم ندهن به اللحم جيدا ( و أرسلت الطبق لطهيه في فران الحي كيجى محمر أحسن و لذييذ جدا)',
        'نفرش الطبق بالخس و نضع فيه اللحم و نصفف الخضر المبخرة في الجوانب',
        'نقدمه مع الصلصات',
      ],
    ),
    Recipe(
      id: 'kotlit-mchwi',
      imageAsset: 'assets/images/kotlit-mchwi.jpeg',
      title: 'كوطليط مشوي',
      rating: 4.5,
      ingredients: [
        'كوطليط',
        'زيت',
        'ملح',
        'ابزار',
        'كمون',
        'قزبر يابس مطحون',
      ],
      cookGuides: [
        'نمزج جميع المكونات مع الكوطليط جيدا و نتركه لساعتين أو أكثر',
        'ثم نشويه',
      ],
    ),
    Recipe(
      id: '9tban-l7em-b-tetbila',
      imageAsset: 'assets/images/9tban-l7em.jpeg',
      title: 'قضبان اللحم بتتبيلة رائعة',
      rating: 4.8,
      ingredients: [
        'مكعبات اللحم',
        'ملح',
        'ابزار',
        'كمون',
        'سكنجبير',
        'فلفل أحمر',
        'موطارد',
        'قزبر يابس مطحون',
        'معدنوس مقطع',
        'شويه زعتر محكوك',
        'شويه عسل',
        'ياغورت طبيعي',
      ],
      cookGuides: [
        'نمزج كل المكونات جيدا و نضيف قطع اللحم ثم نمزج و نحتفظ به في الثلاجة ليله كاملة',
        'نضع قطع اللحم في القضبان مع قطع البصل ثم نشويهم',
        'نحضر صلصه مرافقة',
        'نقضع شويه بصل رقيق ثم نضعف فوق النار مع زيت زيتون حتى يذبل ثم نضيف ماتبقى من صلصة قطع اللحم و نحركها فوق النار ثم نرافقها مع القضبان',
      ],
    ),
    Recipe(
      id: 'kskso-lblboula-blkrdas',
      imageAsset: 'assets/images/kskso-lblboula-blkrdas.jpeg',
      title: 'كسكسو البلبولة بالكرداس',
      rating: 4.7,
      ingredients: [
        'كسكسو البلبولة',
        'الكرداس (يمكن تعويضه باللحم مع اضافة شوية سمن)',
        'خضر متنوعة (بصل+جزر+لفت+قرع اخضر و أحمر+طماطم+فول+ملفوف+حزمة قزبر و معدنوس..)',
        'حمص',
        'زيت عادية و زيت زيتون',
        'ملح',
        'ابزار',
        'خرقوم',
      ],
      cookGuides: [
        'نبلل البلبولة بالماء جيدا مع الضغط عليها بين ايدينا ونتركها تتشرب لنصف ساعة تقريبا',
        'نضع الكرداس في البرمة (بعد ما رطبناه ليلة كاملة في الماء) معبصل مقطع  زيت عادية و زيت زيتون ملح ابزار خرقوم و نتركه يتقلى قليلا ثم نضيف الماء و نغطي',
        'في طنجزة صغيرة نضع القرع الاحمر و الاخضر مع ملح ابزار زيت زيتون و خرقوم',
        'بعد غليان الطنجرة جيدا نضيف الخضر و في الاخير نضيف قطع الطماطم',
        'بعد ما تشرب الكسكس نضعه في الكسكاس و نضعه ليفور ل 45 دقيقة تقريبا',
        'ثم نزيله و نضعه في القصرية و نحرك ثم نضيف الماء من جديد و نحركه ثم نتركه يتشرب و نعيده للكسكسس يفور ثم نزيله و نرش الملح والماء من جديد و نتركه يتشرب و نعيده للطنجرة ليكمل طهيه',
        'نضع الكسكس في طبق التقديم ثم نسقيه بالمرق و نضع الخضر',
      ],
    ),
    Recipe(
      id: 'tajine-lmkh',
      imageAsset: 'assets/images/tajine-lmkh.jpeg',
      title: 'طاجين المخ',
      rating: 4.5,
      ingredients: [
        'المخ',
        'بصل',
        'طماطم',
        'زيت زيتون',
        'ثوم',
        'ملح',
        'ابزار',
        'خرقوم',
        'كمون',
        'فلفل احمر',
      ],
      cookGuides: [
        'نأخذ البصل و نقطعه شرائح و نعملوها في طاجين و نضيف له زيت زيتون و ملح و ابزار و نعملوها على النار حتى تذبل قليلا',
        'نضيف قطع الطماطم وباقي المكونات و نحرك ثم نضيف شوية ماء و نتركه حتى تطهى البصل و الطماطم',
        'نأخذ المخ نضعه في الماء الساخن جدا ثم نزيله و نزيل له الجلدة الرقيقه',
        'نغسله و نقطعه لقطع',
        'نضعه في الطاجين و نتركه يطهى ثم نقلبه حتى يكمل طهيه و نقدمه',
      ],
    ),
  ];

  Recipes({this.favorites}) {
    //  you should import the favorites from device storage
    if (favorites == null) favorites = Favorites([]);
  }

  Recipe operator [](int index) => items[index];

  int get length => items.length;

  List<Recipe> get favItems =>
      [...items.where((rcp) => favorites!.isFavorite(rcp.id))];

  Recipe getRecipeByID(String id) => items.firstWhere((rcp) => id == rcp.id);
}
